# Importar la biblioteca de pandas

In [1]:
import pandas as pd

Utilizando unos datos b√°sicos

In [2]:
fruits = ['apple', 'orange', 'pear', 'grape']
cookies = ['alfajor', 'biscuit', 'biscocho', 'pecan']

Para poder demostrar algunas funcionalidades de pandas se muestra como se crea el dataframe

# Como crear un dataframe?

Mediante una lista

In [3]:
pd.DataFrame(fruits, columns=['Frutas'])

   Frutas
0   apple
1  orange
2    pear
3   grape

Varias listas para agregar filas

In [4]:
pd.DataFrame([fruits, cookies])

         0        1         2      3
0    apple   orange      pear  grape
1  alfajor  biscuit  biscocho  pecan

Mediante una lista de tuplas

In [5]:
pd.DataFrame([('apple', 'orange', 'pear', 'grape'), 
              ('alfajor', 'biscuit', 'biscocho', 'pecan')])

         0        1         2      3
0    apple   orange      pear  grape
1  alfajor  biscuit  biscocho  pecan

Mediante una lista de  diccionarios

In [6]:
pd.DataFrame([
    {'apple':  1,  'orange' : 2 ,  'pear' : 3 ,  'grape': 4 },
    {'apple':  'a',  'orange' : 'b' ,  'pear' : 'c' ,  'grape': 'd' },
])

  apple grape orange pear
0     1     4      2    3
1     a     d      b    c

Mediante un diccionario de listas

In [7]:
pd.DataFrame(
    {'apple' : [1,2,3,4,5,6],
    'orange' : ['a','b','c','d','e','f'] }
)

   apple orange
0      1      a
1      2      b
2      3      c
3      4      d
4      5      e
5      6      f

## Ediciones comunes al dataframe

Suponga que se crea un dataframe df

In [8]:
df= pd.DataFrame(
    {'apple' : [1,2,3,4,5,6],
    'orange' : ['a','b','c','d','e','f'] }
)

In [9]:
### head() para poder visualizar el encabezado del df. Se pueden ver las primeras filas
df.head()

   apple orange
0      1      a
1      2      b
2      3      c
3      4      d
4      5      e

In [10]:
### rename() para poder cambiar el nombre de las columnas
df.rename(columns={'apple': 'primero', 'orange':'segundo'})

   primero segundo
0        1       a
1        2       b
2        3       c
3        4       d
4        5       e
5        6       f

In [11]:
## Para seleccionar alguna columna
df['apple']

0    1
1    2
2    3
3    4
4    5
5    6
Name: apple, dtype: int64

In [12]:
## Para seleccionar alguna fila
# por n√∫mero de fila
df.iloc[2:4]

   apple orange
2      3      c
3      4      d

In [13]:
## Por nombre de etiqueta del √≠ndice
df.loc[4:5]

   apple orange
4      5      e
5      6      f

In [14]:
### Para configurar el √≠ndice
df.set_index('orange')

        apple
orange
a           1
b           2
c           3
d           4
e           5
f           6

In [15]:
# Para mapear algunos valores hacia otros
df['orange'].map({'a': 'A', 'b':'B'})

0      A
1      B
2    NaN
3    NaN
4    NaN
5    NaN
Name: orange, dtype: object

In [16]:
df['orange'].map('Letra: {}'.format)

0    Letra: a
1    Letra: b
2    Letra: c
3    Letra: d
4    Letra: e
5    Letra: f
Name: orange, dtype: object

In [17]:
# Para aplicar funciones hacia valores en una columna
df['apple'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
4    25
5    36
Name: apple, dtype: int64

In [18]:
# Para aplicar funciones a todo el dataframe
df.apply(lambda x : x*2)

   apple orange
0      2     aa
1      4     bb
2      6     cc
3      8     dd
4     10     ee
5     12     ff

## Edici√≥n

In [19]:
# Aplicar un valor constante a un sector del dataframe
df.iloc[2:4] = None
df

   apple orange
0    1.0      a
1    2.0      b
2    NaN   None
3    NaN   None
4    5.0      e
5    6.0      f

In [20]:
# Para rellenar las celdas nulas con alg√∫n valor
df.fillna(0)

   apple orange
0    1.0      a
1    2.0      b
2    0.0      0
3    0.0      0
4    5.0      e
5    6.0      f

In [21]:
# Para borrar las filas con valores nulos
df.dropna()

   apple orange
0    1.0      a
1    2.0      b
4    5.0      e
5    6.0      f

In [22]:
# Para borrar alguna columna
df.drop(columns=['apple'])

  orange
0      a
1      b
2   None
3   None
4      e
5      f

In [23]:
# Para borrar alguna fila por el √≠ndice
df.drop(index=[2])

   apple orange
0    1.0      a
1    2.0      b
3    NaN   None
4    5.0      e
5    6.0      f

In [24]:
df

   apple orange
0    1.0      a
1    2.0      b
2    NaN   None
3    NaN   None
4    5.0      e
5    6.0      f

## Agregar

In [25]:
df['cookies'] = ['alfajor', 'biscuit', 'biscocho', 'pecan', 'soda', 'chiky']
df

   apple orange   cookies
0    1.0      a   alfajor
1    2.0      b   biscuit
2    NaN   None  biscocho
3    NaN   None     pecan
4    5.0      e      soda
5    6.0      f     chiky

In [26]:
# Agregar una fila
df.append({'apple':7, 'orange':'g', 'cookies': 'pie'}, ignore_index=True)

   apple orange   cookies
0    1.0      a   alfajor
1    2.0      b   biscuit
2    NaN   None  biscocho
3    NaN   None     pecan
4    5.0      e      soda
5    6.0      f     chiky
6    7.0      g       pie

### Salvar el archivo

In [27]:
df.to_csv('archivo.csv', index=False)

### Leer el archivo

In [28]:
pd.read_csv('archivo.csv')

   apple orange   cookies
0    1.0      a   alfajor
1    2.0      b   biscuit
2    NaN    NaN  biscocho
3    NaN    NaN     pecan
4    5.0      e      soda
5    6.0      f     chiky